import React from 'react';
import styles from './InfoPage.module.css';

const InfoPage = () => {
  return (
    <div className={styles.infoPage}>
      <h1>Інформація</h1>
      <ul>
        <li>
          <strong>Контакти:</strong> З усіх питань та замовлень звертайтесь до нашого Instagram —
          <a href="https://instagram.com/rnc.ua" target="_blank" rel="noopener noreferrer">@rnc.ua</a>
        </li>
        <li>
          <strong>Політика повернення:</strong> Усі товари не підлягають поверненню або обміну. Будь ласка, перевіряйте замовлення перед покупкою.
        </li>
        <li>
          <strong>Час обробки замовлень:</strong> Обробка замовлень займає 20-30 робочих днів. Ми робимо все можливе, щоб доставити ваші товари якнайшвидше, але маємо постачальників з усього світу, щоб ви вдягали лише найякісніші речі.
        </li>
        <li>
          <strong>Доставка:</strong> Ми надаємо доставку по всій Україні. Вартість доставки оплачується самостійно покупцем. За вартість доставлення відповідає компанія пошти, на яке потрапляє посилка.
        </li>
        <li>
          <strong>Способи оплати:</strong> Ми приймаємо оплату через банківські картки. Всі платежі захищені та безпечні.
        </li>
        <li>
          <strong>Конфіденційність:</strong> Ми поважаємо вашу конфіденційність і не передаємо ваші особисті дані третім особам. Всі дані захищені і використовуються тільки для обробки замовлень.
        </li>
        <li>
          <strong>Гарантія якості:</strong> Ми гарантуємо високу якість всіх наших товарів. Продаємо лише ті товари, в яких ми впевнені не тільки виглядом, а й якістю.
        </li>
      </ul>
    </div>
  );
};

export default InfoPage;
